Repository: AlexanderJohr/inheritable_submissions_form_generator
Catalog: localization/app_*.arb
Languages: de

# appTitle
source: json_to_survey
de: Dyfogen

# loginViaInstituteText
source: Direct connection to database
de: Direkte Verbindung zur Datenbank

# loginViaSSHTunnel
source: Via SSH tunnel
de: Über SSH Tunnel

# databaseHostLabel
source: Database Host
de: Datenbank-Host

# databaseNameLabel
source: Database Name
de: Datenbank-Name

# userNameLabel
source: User Name
de: Benutzername

# passwordLabel
source: Password
de: Passwort

# sendButtonText
source: send
de: absenden

# validatorText
source: Please enter text
de: Bitte Text eingeben

# selectSurveyTitle
source: Select survey
de: Umfrage auswählen

# errText
source: Error Please inform the developer. Error: {error} {stackTrace}
de: Fehler Bitte Entwickler Bescheid geben. Error: {error} {stackTrace}

# addSubmissionTitle
source: Add submission
de: Umfrage hinzufügen

# submissionTitleLabel
source: submission title
de: Umfragen-Titel

# addButtonText
source: add
de: Hinzufügen

# exactValueLabelText
source: exact value
de: Exakter Wert

# selectSubmissionTitle
source: select submission
de: Umfrage-Einsendung wählen

# createdByLabel
source: Created by:
de: Erstellt von:

# createdLabel
source: Created:
de: Erstellt:

# deleteSubmissionQuestionText
source: Delete {submissionTitle}?
de: {submissionTitle} wirklich löschen?

# deleteButtonText
source: Delete
de: Löschen

# searchPlaceholderText
source: search for...
de: Suchen...

# searchSubmissionLabel
source: Search submission
de: Einsendung suchen

# creatorText
source: Creator:
de: Ersteller:

# noSelectionText
source: No selection
de: Keine Auswahl

# textConcretisationLabelText
source: Text concretisation
de: Textkonkretisierung

# valueSpanLabelText
source: Range (From...To)
de: Spanne (von...bis)

# quantityAndAraSpecificationText
source: Quantity/area specification:
de: Mengen-/Flächenvorgabe:

# pleaseEnterTextMessage
source: Please enter text
de: Bitte Text eingeben

# exactDateLabelText
source: Exact date
de: Exakte Datumsangabe

# timeSpanLabelText
source: Time period (start and/or end specified)
de: Zeitspanne (Beginn und/oder Ende angegeben)

# fromDateLabelText
source: From (start only)
de: Von (nur Beginn angegeben)

# toDateLabelText
source: Until (only end specified)
de: Bis (nur Ende angegeben)

# fromToDateLabelText
source: From To (start and end specified)
de: Von Bis (Beginn und Ende angegeben)

# durationInHoursLabelText
source: Duration in hours
de: Dauer in Stunden

# dayAndMonthLabelText
source: Day and month
de: Tag und Monat

# onlyMonthLabelText
source: Just month
de: Nur Monat

# fromMonthEditLabelText
source: From (month)
de: Von (Monat)

# toMonthEditLabelText
source: To (month)
de: Bis (Monat)

# fromDayEditLabelText
source: From (day)
de: Von (Tag)

# toDayEditLabelText
source: To (day)
de: Bis (Tag)

# dayEditLabelText
source: Day
de: Tag

# monthEditLabelText
source: Month
de: Monat

# timeLimitText
source: Time span
de: Zeitvorgabe:

# errNoAppStateFoundText
source: No AppState found in this context
de: Kein AppState im 'context' gefunden

# passedOnToText
source: Passed on to:
de: Weitervererbt an:

# notPassedOnButDefinedText
source: Not passed on but defined in:
de: Nicht weitervererbt aber definiert in:

# inheritedText
source: Inherited:
de: Geerbt:

# inheritedFromText
source: Inherited from:
de: Geerbt von:

# canBeInheritedFromText
source: Can be inherited from:
de: Kann geerbt werden von:

# errChoiceQuestionAnswerDoesntExistText
source: The answer with the code {noChoiceQuestionAnswer} does not exist in the survey structure. Please migrate if necessary and delete this answer.
de: Die Antwort mit dem Code {noChoiceQuestionAnswer} existiert nicht in der Umfragestruktur. Bitte ggf. migieren und diese Antwort löschen.

# errCheckParentAnswerInheritText
source: This non-existent response was originally inherited from the parent {parentTitle}. Please also check in the parent whether this response is incorrectly activated.
de: Diese nicht existierende Antwort wurde ursprünglich vom Vater {parentTitle} geerbt. Bitte auch im Vater überprüfen, ob diese Antwort fälschlicherweise aktiviert ist.

# errIncorrectLinkingToParentText
source: In the father {parentTitle}, the inherited answer is either not selected or the inheritance of this submission to the father submission has been completely cancelled. Please check the link to the father. If the link exists and or has been restored and this error still appears, please remove this selection to avoid inconsistencies.
de: Im Vater {parentTitle} ist die geerbte Antwort entweder nicht selektiert oder die Vererbung dieser Umfrage zur Vater-Umfrage wurde ganz aufgelöst. Bitte Verlinkung zum Vater überprüfen. Falls die Verlinkung besteht und oder wiederhergestellt wurde, und dieser Fehler dennoch erscheint, bitte diese Selektion entfernen, um Inkosistenzen zu vermeiden.

# errInheritedAnswerWithoutSubmissionText
source: The surveys: {parentTitle} inherit this answer, although it is no longer selected in this submission.
de: Die Einsendungen: {parentTitle} erben diese Antwort, obwohl sie in diesen Einsendungen gar nicht mehr selektiert ist.

source: Free text
de: Freitext

# cautionConcretisationOfParentText
source: Attention. These are the concretisations of the parent. Changes here are also changed for the parent. Do you want to overwrite the parents details without changing the parents details? Then add a further specification here in the child that differs from the parents.
de: Achtung. Dies sind die Konkretisierungen des Vaters. Änderungen hier werden auch beim Vater geändert. Sollen die Angaben des Vaters vom überschrieben werden, ohne die Angaben des Vaters zu ändern? Dann hier im Kind eine weitere Konkretisierung hinzufügen, die vom Vater abweicht.

# errNoChoiceQuestionAnswerServiceFoundText
source: No ChoiceQuestionAnswerService found in context
de: Kein ChoiceQuestionAnswerService im context gefunden

# deleteAnswerTitle
source: Really delete answer {answerTitle}?
de: Die Antwort {answerTitle} wirklich löschen?

# deleteAnswerContentText
source: The answer {answerTitle} is deleted, but it contains concretisations. The deletion also deletes these concretisations. Should the answer really be deleted and thus the concretisations deleted?
de: Die Antwort {answerTitle} wird gelöscht, doch sie enthält Konkretisierungen. Durch die Löschung werden auch diese Konkretisierungen gelöscht. Soll die Antwort wirklich gelöscht und damit die Konkretisierungen gelöscht werden?

# acceptDeleteTitle
source: Delete answer and its concretisations
de: Antwort und dessen Konkretisierungen löschen

# cancelDeleteTitle
source: Cancel delete
de: Löschen abbrechen

# concretisationsAndAnsweredSubQuestionsText
source: Concretisations and answered sub-questions
de: Konkretisierungen und beantwortete Unterfragen

# concretisationText
source: Concretisation
de: Konkretisierungen

# answeredSubQuestionsText
source: Answered sub-questions
de: beantwortete Unterfragen

# concretisationsMovedAndSubQuestionsDeletedText
source: moved the concretisations to {answerToReplaceWithTitle} and deleted the answered subquestions
de: die Konkretisierungen in {answerToReplaceWithTitle} verschoben und die beantwortete Unterfragen gelöscht

# concretisationsMovedText
source: moved the concretisations to {answerToReplaceWithTitle}
de: die Konkretisierungen in {answerToReplaceWithTitle} verschoben

# deleteAnsweredSubQuestions
source: the answered sub-questions deleted
de: die beantworteten Unterfragen gelöscht

# concretisationsMovedAndSubQuestionsDeletedTitle
source: Move concretisations and delete sub-answers
de: Konkretisierungen verschieben und Unterantworten löschen

# concretisationsMovedTitle
source: Move concretisations
de: Konkretisierungen verschieben

# deleteSubAnswersTitle
source: Delete sub-answers
de: Unterantworten löschen

# replaceAnswersQuestion
source: Really replace the answer {answerToReplaceOrDelete} with {replaceAnswer}?
de: Die Antwort {answerToReplaceOrDelete} wirklich mit {replaceAnswer} ersetzen?

# replaceFollowUpMessagesText
source: The response {answerToReplaceOrDelete} is replaced with {replaceAnswer}, but it contains {contextMessage}.
de: Die Antwort {answerToReplaceOrDelete} wird mit {replaceAnswer} ersetzt, doch sie enthält {contextMessage}.

# replaceAndCreateAcceptTitle
source: Replace and {createAcceptTitleContext}
de: Ersetzen und {createAcceptTitleContext}

# abortReplaceCancelTitle
source: Abort replace
de: Ersetzen abbrechen

# confirmButtonToolTipText
source: Accept selection
de: Auswahl übernehmen

# errInFormText
source: Error in form
de: Fehler im Formular.

# noSubmissionSelectedText
source: no submission selected
de: keine Einsendung gewählt

# errIncorrectInherit
source: Something went wrong with the inherit. Please show this message to the developer. Details: {error}
de: Beim Erben ist etwas schief gelaufen. Bitte diese Nachricht dem Entwickler zeigen. Details: {error}

# errNoViewDefined
source: No View defined for {question}.
de: Für {question} ist keine View definiert.

# unlinkSubmissionInheritTitle
source: Cancel the inherit for {linkedSubmission}?
de: Die Vererbung zur Einsendung {linkedSubmission} wirklich aufheben?

# unlinkSubmissionInheritContentText
source: Cancel the inheritance for the {linkedSubmission} submission? Properties may be inherited from this submission. Should inherited properties also be removed?
de: Die Vererbung zur Einsendung {linkedSubmission} wirklich aufheben? Von dieser Einsendung werden möglicherweise Eigenschaften geerbt. Sollen geerbten Eigenschaften ebenfalls entfernt werden?

# unlinkSubmissionInheritAcceptTitle
source: Cancelling inheritance and removing inherited properties
de: Vererbung aufheben und geerbte Eigenschaften entfernen

# unlinkSubmissionInheritCancelTitle
source: Cancel
de: Abbrechen

# hiddenBySelectionsText
source: is hidden by the selections in the previous selection fields.
de: ist durch die Selektionen der vorherigen Auswahlfelder ausgeblendet.

# questionRequiredValuesText
source: {question} must contain one of the following values:
de: {question} muss einen der folgenden Werte enthalten:

# questionCantCotainValuesText
source: {question} must not contain any of the following values:
de: {question} darf keinen der folgenden Werte enthalten:

# noConditionDefinedText
source: No condition is defined.
de: Es ist keine Bedingung hinterlegt.

# errConditionsText
source: A condition should be of type ContainsAnyOf, ContainsNoneOf, CheckAllConditions or null. A chart for condition of type {runtimeType} is not defined.
de: Eine Condition sollte vom Typ ContainsAnyOf, ContainsNoneOf, CheckAllConditions oder null sein. Ein Chart für eine Condition vom Typ {runtimeType} ist nicht definiert.

# questionContainsErrorText
source: Questions has errors
de: Die Frage hat Fehler

# singleChoiceQuestionText
source: The Single-Choice question
de: Die Single-Choice Frage

# singleChoiceQuestionNeedsAnswerText
source: must contain an answer. But its empty.
de: muss eine Antwort enthalten. Doch sie ist leer.

# containsAnswerText
source: contains answer
de: enthält die Antwort

# containsMultipleAnswersText
source: contains multiple answers
de: enthält die Antworten

# severalTimesText
source: several times.
de: mehrfach.

# mustText
source: must contain
de: muss

# exactlyOneText
source: exactly one
de: genau eine

# haveAnswerText
source: answer.
de: Antwort enthalten.

# theQuestionText
source: The question
de: Die Frage

# hasOneAnswerButText
source: has an answer, but the question is a sub-question of
de: hat eine Antwort, doch die Frage ist eine Unter-Frage von

# thisOptionsAreDeactivatedText
source: . These questions and answers are deactivated.
de: . Diese Fragen bzw. Antworten sind deaktiviert.

# theConditionForText
source: The condition for
de: Die Bedingung für

# isNotSatisfiedButText
source: is not fulfilled, but it has the sub-answer:
de: ist nicht erfüllt, doch sie hat die Unter-Antwort:

# abortText
source: cancel
de: Abbrechen

# whatShouldHappenWithInheritanceText
source: What should happen to the inheritance of this answer?
de: Was soll mit der Weitervererbung dieser Antwort geschehen

# theAnswerText
source: The answer
de: Die Antwort

# willBeInheritedText
source: is passed on to
de: wird an

# whatShouldHappenText
source: . What should happen?
de: weitervererbt. Was soll geschehen?

# deleteWithLineBreakText
source: Delete
de: Löschen

# theAnswerWithLineBreaksText
source: the answer
de: die Antwort

# deleteWithSpaceText
source: will be deleted.
de: löschen.

# keepAnswerText
source: Keep answer
de: Behalten

# indicateThatInheritanceIsNotValidText
source: and indicate an error that the inheritance is not valid.
de: behalten und einen Fehler anzeigen, dass die Vererbung nicht valide ist.

# errorTitle
source: Error
de: Fehler

# selectAllText
source: Select all
de: Alles auswählen

# deselectAllText
source: Deselect all
de: Alles abwählen

# containsExactlyText
source: contains exactly the following
de: enthält genau die folgenden

# containsAnyOfText
source: contains one of the following
de: enthält eines der folgenden

# whichPropertiesShouldBeInheritedText
source: Which properties should be inherited?
de: Welche Eigenschaften sollen geerbt werden?

# applyPropertiesText
source: Apply properties
de: Eigenschaften übernehmen

# sameChangeInChildrenText
source: Make the same change in children
de: Gleiche Änderung in Kindern vornehmen

# alsoText
source: also replace
de: ebenfalls

# withText
source: with
de: mit

# renameSubmissionTitle
source: Rename {submissionTitle} in ...
de: {submissionTitle} umbenennen in ...

# newTitleText
source: New title
de: Neuer Titel

# renameText
source: Rename
de: Umbenennen

source: Copy of {submissionTitle}
de: Kopie von {submissionTitle}

# submissionTitleForDuplicateText
source: Submission title for the duplicate
de: Einsendungs-Titel für das Duplikat

# duplicateText
source: Duplicate
de: Duplizieren

# noSurveyPathInContextFoundText
source: No SurveyPath object in context found.
de: Kein SurveyPath-Objekt in context gefunden.

# noSelectedSubmissionInContextFoundText
source: No SelectedSubmission object in context found.
de: Kein SelectedSubmission-Objekt in context gefunden.
